# Reading data

#### .tsv files have tab as seperator

In [1]:
import pandas as pd

In [2]:
data = pd.read_table("http://bit.ly/chiporder")

C:\Users\Dell\Anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead, passing sep='\t'.
  """Entry point for launching an IPython kernel.

In [3]:
data.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [4]:
data.shape

(4622, 5)

In [5]:
data1 = pd.read_table('http://bit.ly/movieusers')

C:\Users\Dell\Anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead, passing sep='\t'.
  """Entry point for launching an IPython kernel.

In [6]:
 data1.head()

   1|24|M|technician|85711
0       2|53|F|other|94043
1      3|23|M|writer|32067
2  4|24|M|technician|43537
3       5|33|F|other|15213
4   6|42|M|executive|98101

#### read_data considers tab as default seperator..
#### To assign different seperator we have to randomly give it.

In [7]:
data2 = pd.read_table('http://bit.ly/movieusers',sep='|')

C:\Users\Dell\Anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

In [8]:
data2.head()

   1  24  M  technician  85711
0  2  53  F       other  94043
1  3  23  M      writer  32067
2  4  24  M  technician  43537
3  5  33  F       other  15213
4  6  42  M   executive  98101

#### Note there is no header

In [9]:
data2 = pd.read_table('http://bit.ly/movieusers',sep='|', header = None)

C:\Users\Dell\Anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

In [10]:
data2.head()

   0   1  2           3      4
0  1  24  M  technician  85711
1  2  53  F       other  94043
2  3  23  M      writer  32067
3  4  24  M  technician  43537
4  5  33  F       other  15213

In [11]:
col_names = ['id','Age','Gender','Occupation','Revenue']

In [12]:
data2 = pd.read_table('http://bit.ly/movieusers',sep='|',header = None,names = col_names)

C:\Users\Dell\Anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

In [13]:
data2.head()

   id  Age Gender  Occupation Revenue
0   1   24      M  technician   85711
1   2   53      F       other   94043
2   3   23      M      writer   32067
3   4   24      M  technician   43537
4   5   33      F       other   15213

## Difference between Series and Data Frame

### id,Age,Gender etc are diff. series..each series should contain data of similar datatype
### Collection of diff. series is known as data frame

In [14]:
type(data2['Age'])

pandas.core.series.Series

## Adding a new column which is the result of the computed from two or more series of the given data set

In [15]:
data2['new'] = data2['Occupation']+data2['Gender']

In [16]:
data2.head()

   id  Age Gender  Occupation Revenue          new
0   1   24      M  technician   85711  technicianM
1   2   53      F       other   94043       otherF
2   3   23      M      writer   32067      writerM
3   4   24      M  technician   43537  technicianM
4   5   33      F       other   15213       otherF

## Reading csv files

In [17]:
data_csv = pd.read_csv("http://bit.ly/imdbratings")

In [18]:
data_csv.describe()

#gives all the stats about the numerical data

       star_rating    duration
count   979.000000  979.000000
mean      7.889785  120.979571
std       0.336069   26.218010
min       7.400000   64.000000
25%       7.600000  102.000000
50%       7.800000  117.000000
75%       8.100000  134.000000
max       9.300000  242.000000

### In pandas all string values are object types

In [21]:
data_csv.describe(include = ['object','int64'])

,title,content_rating,genre,duration,actors_list
count,979,976,979,979.000000,979
unique,975,12,16,NaN,969
top,Dracula,R,Drama,NaN,"[u'Daniel Radcliffe', u'Emma Watson', u'Rupert..."
freq,2,460,278,NaN,6
mean,NaN,NaN,NaN,120.979571,NaN
std,NaN,NaN,NaN,26.218010,NaN
min,NaN,NaN,NaN,64.000000,NaN
25%,NaN,NaN,NaN,102.000000,NaN
50%,NaN,NaN,NaN,117.000000,NaN
75%,NaN,NaN,NaN,134.000000,NaN
max,NaN,NaN,NaN,242.000000,NaN

In [22]:
data_csv.dtypes

star_rating       float64
title              object
content_rating     object
genre              object
duration            int64
actors_list        object
dtype: object

In [23]:
data_csv.head()

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

# Renaming a column

In [26]:
data_csv.rename(columns = {'star_rating':'starRating'},inplace=True)

In [27]:
data_csv.head()

,starRating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

###### Alternative

In [30]:
data_col = ['StarRating','Title','content_rating','Genre','duration','actors_list']
data_csv.columns = data_col

In [31]:
data_csv.head()

,StarRating,Title,content_rating,Genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [34]:
#To replace a particular set a word(s)
data_csv.columns = data_csv.columns.str.replace('_','')